# Задание 1 - Работа с переменными
print('Задание 1 - Работа с переменными')
num1 = 56
num2 = 72.43
str1 = 'Мой дядя самых честных правил.'
str2 = 'И немедленно выпил.'
print('Введены следующие переменные:')
print(f'num1 = {num1}')
print(f'num2 = {num2}')
print(f'str1 = {str1}')
print(f'str2 = {str2}')
num1 = input('Введите новое значение для переменной num1. Это должно быть число: ')
num2 = input('Введите новое значение для переменной num2. Пусть это будет текст: ')
str1 = input('Введите новое значение для переменной str1. Это можеть быть и число и текст: ')
print('А переменная str2 примет значение True.')
str2 = True
print('Теперь переменные содержат следующие значения:')
print(f'num1 = {num1}')
print(f'num2 = {num2}')
print(f'str1 = {str1}')
print(f'str2 = {str2}')