# Задание 3 - n + nn + nnn
print('Задание 3 - n + nn + nnn')
n = input('Введите число:')
nn = n + n
nnn = nn + n
print(f'n + nn + nnn = {int(n) + int(nn) + int(nnn)}')